week04/music_concerts_network/app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts"
---
	def index
		@concerts = Concert.all

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", nil]]
---
	def edit
		@concert = Concert.find_by(id: params[:id])