week04/day17/timetracking2/app/views/entries/index.html.erb

<ul>
<% @project.entries.each do |x| %>
---
SELECT "entries".* FROM "entries" WHERE "entries"."project_id" = ?  [["project_id", 1]]